NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_health_server.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <unity.h>
#include <cmock.h>

#include "access_mock.h"
#include "access_config_mock.h"
#include "access_reliable_mock.h"
#include "bearer_event_mock.h"
#include "timer_scheduler_mock.h"
#include "nrf_mesh_mock.h"

#include "health_messages.h"
#include "health_opcodes.h"
#include "health_server.h"

#include "utils.h"

#define TEST_MODEL_HANDLE   14
#define TEST_ELEMENT_INDEX  42
#define TEST_COMPANY_ID     0x1234

#define ACCESS_MESSAGE_RX(req, op) \
    { \
        .opcode = ACCESS_OPCODE_SIG(op), \
        .p_data = (const uint8_t *) &req, \
        .length = sizeof(req) \
    }

#define ACCESS_MESSAGE_RX_EMPTY(op) \
    { \
        .opcode = ACCESS_OPCODE_SIG(op), \
        .p_data = NULL, \
        .length = 0, \
    }

/********** Static variables and mock functions **********/

static const access_opcode_handler_t * mp_opcode_handlers;
static uint16_t m_num_opcodes;

static access_model_handle_t m_model_handle;

static uint32_t access_model_add_mock(const access_model_add_params_t * p_init_params,
        access_model_handle_t * p_model_handle, int count)
{
    m_model_handle = TEST_MODEL_HANDLE;
    *p_model_handle = m_model_handle;

    mp_opcode_handlers = p_init_params->p_opcode_handlers;
    m_num_opcodes = p_init_params->opcode_count;

    TEST_ASSERT_EQUAL(HEALTH_SERVER_MODEL_ID, p_init_params->model_id.model_id);
    TEST_ASSERT_EQUAL(ACCESS_COMPANY_ID_NONE, p_init_params->model_id.company_id);

    return NRF_SUCCESS;
}

static timestamp_t m_current_time;
timestamp_t timer_now(void)
{
    return m_current_time;
}

#define EXPECT_TIMER_SCH_SCHEDULE() \
    TEST_ASSERT_FALSE(m_timer_sch_schedule_expected); \
    m_timer_sch_schedule_expected = true

#define TIMER_SCH_TRIGGER() \
    do { \
        if(mp_timer_sch_event->interval != 0) \
        { \
            mp_timer_sch_event->timestamp += mp_timer_sch_event->interval; \
            m_current_time += mp_timer_sch_event->interval; \
        } \
        else \
        { \
            m_current_time = mp_timer_sch_event->timestamp; \
        } \
        mp_timer_sch_event->cb(m_current_time, mp_timer_sch_event->p_context); \
    } while(0);

static bool m_timer_sch_schedule_expected = false;
static timer_event_t * mp_timer_sch_event;

void timer_sch_schedule_mock(timer_event_t * p_event, int count)
{
    TEST_ASSERT_TRUE(m_timer_sch_schedule_expected);
    m_timer_sch_schedule_expected = false;

    mp_timer_sch_event = p_event;
}

#define EXPECT_PUBLISH_PERIOD_GET(x_handle, x_retval_res, x_retval_steps) \
    do { \
        TEST_ASSERT_FALSE(m_publish_period_get_expected); \
        m_publish_period_get_expected = true; \
        m_publish_period_get_expected_handle = x_handle; \
        m_publish_period_get_retval_res = x_retval_res; \
        m_publish_period_get_retval_steps = x_retval_steps; \
    } while(0)
static bool m_publish_period_get_expected = false;
static access_model_handle_t m_publish_period_get_expected_handle;
static access_publish_resolution_t m_publish_period_get_retval_res;
static uint8_t m_publish_period_get_retval_steps;

static uint32_t access_model_publish_period_get_mock(access_model_handle_t handle,
        access_publish_resolution_t * p_res, uint8_t * p_steps, int count)
{
    TEST_ASSERT_NOT_NULL(p_res);
    TEST_ASSERT_NOT_NULL(p_steps);

    TEST_ASSERT_TRUE(m_publish_period_get_expected);
    m_publish_period_get_expected = false;

    TEST_ASSERT_EQUAL(m_publish_period_get_expected_handle, handle);

    *p_res = m_publish_period_get_retval_res;
    *p_steps = m_publish_period_get_retval_steps;

    return NRF_SUCCESS;
}

#define EXPECT_REPLY(x_handle, x_opcode, xp_expected_data, x_expected_data_length) \
    do { \
        TEST_ASSERT_FALSE(m_reply_expected); \
        m_reply_expected = true; \
        m_reply_expected_handle = x_handle; \
        m_reply_expected_opcode = x_opcode; \
        mp_reply_expected_data = xp_expected_data; \
        m_reply_expected_data_length = x_expected_data_length; \
    } while(0)

