NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_health_server.c
static bool m_reply_expected = false;
static access_model_handle_t m_reply_expected_handle;
static uint16_t m_reply_expected_opcode;
static void * mp_reply_expected_data;
static uint16_t m_reply_expected_data_length;

static uint32_t access_model_reply_mock(access_model_handle_t handle, const access_message_rx_t * p_message,
        const access_message_tx_t * p_reply, int count)
{
    TEST_ASSERT_NOT_NULL(p_message);
    TEST_ASSERT_NOT_NULL(p_reply);

    TEST_ASSERT_TRUE(m_reply_expected);
    m_reply_expected = false;

    TEST_ASSERT_EQUAL(m_reply_expected_handle, handle);
    TEST_ASSERT_EQUAL(m_reply_expected_opcode, p_reply->opcode.opcode);
    TEST_ASSERT_EQUAL(ACCESS_COMPANY_ID_NONE, p_reply->opcode.company_id);
    TEST_ASSERT_EQUAL(m_reply_expected_data_length, p_reply->length);
    TEST_ASSERT_EQUAL_HEX8_ARRAY((const uint8_t *) mp_reply_expected_data, p_reply->p_buffer, p_reply->length);

    return NRF_SUCCESS;
}

#define EXPECT_TX(x_handle, x_opcode, xp_expected_data, x_expected_data_length) \
    do { \
        TEST_ASSERT_FALSE(m_publish_expected); \
        m_publish_expected = true; \
        m_publish_expected_handle = x_handle; \
        m_publish_expected_opcode = x_opcode; \
        mp_publish_expected_data = xp_expected_data; \
        m_publish_expected_data_length = x_expected_data_length; \
    } while(0)

static bool m_publish_expected = false;
static access_model_handle_t m_publish_expected_handle;
static uint16_t m_publish_expected_opcode;
static void * mp_publish_expected_data;
static uint16_t m_publish_expected_data_length;

static uint32_t access_model_publish_mock(access_model_handle_t handle, const access_message_tx_t * p_message, int count)
{
    TEST_ASSERT_NOT_NULL(p_message);

    TEST_ASSERT_TRUE(m_publish_expected);
    m_publish_expected = false;

    TEST_ASSERT_EQUAL(m_publish_expected_handle, handle);
    TEST_ASSERT_EQUAL(m_publish_expected_opcode, p_message->opcode.opcode);
    TEST_ASSERT_EQUAL(ACCESS_COMPANY_ID_NONE, p_message->opcode.company_id);
    TEST_ASSERT_EQUAL(m_publish_expected_data_length, p_message->length);
    TEST_ASSERT_EQUAL(false, p_message->force_segmented);
    TEST_ASSERT_EQUAL(NRF_MESH_TRANSMIC_SIZE_DEFAULT, p_message->transmic_size);
    TEST_ASSERT_EQUAL_HEX8_ARRAY((const uint8_t *) mp_publish_expected_data, p_message->p_buffer, p_message->length);

    return NRF_SUCCESS;
}

static void call_opcode_handler(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    bool handler_found = false;
    for(uint16_t i = 0; i < m_num_opcodes; ++i)
    {
        if (memcmp(&mp_opcode_handlers[i].opcode, &p_message->opcode, sizeof(access_opcode_t)) == 0)
        {
            mp_opcode_handlers[i].handler(handle, p_message, p_args);
            handler_found = true;
            break;
        }
    }

    TEST_ASSERT_TRUE(handler_found);
}

/********** Self-test helper functions **********/

static const uint8_t * mp_next_faults;
static uint8_t m_next_faults_count;

static void selftest_test_function(health_server_t * p_server, uint16_t company_id, uint8_t test_id)
{
    for(uint8_t i = 0; i < m_next_faults_count; ++i)
    {
        health_server_fault_register(p_server, mp_next_faults[i]);
    }
}

/********** Attention timer helper functions **********/

#define EXPECT_ATTENTION_CALLBACK(xp_server, x_attention_state) \
    do { \
        TEST_ASSERT_FALSE(m_attention_callback_expected); \
        m_attention_callback_expected = true; \
        mp_attention_callback_expected_server = xp_server; \
        m_attention_callback_expected_state = x_attention_state; \
    } while(0);
static bool m_attention_callback_expected = false;
static const health_server_t * mp_attention_callback_expected_server;
static bool m_attention_callback_expected_state;

static void attention_callback(const health_server_t * p_server, bool attention_state)
{
    TEST_ASSERT_TRUE(m_attention_callback_expected);
    m_attention_callback_expected = false;

    TEST_ASSERT_EQUAL_PTR(mp_attention_callback_expected_server, p_server);
    TEST_ASSERT_EQUAL(m_attention_callback_expected_state, attention_state);
}

static void verify_attention_timer(health_server_t * p_server, uint8_t expected_attention)
{
    access_message_rx_t request_message = ACCESS_MESSAGE_RX_EMPTY(HEALTH_OPCODE_ATTENTION_GET);
    health_msg_attention_status_t expected_reply = { .attention = expected_attention };
    EXPECT_REPLY(p_server->model_handle, HEALTH_OPCODE_ATTENTION_STATUS, &expected_reply, sizeof(expected_reply));
    call_opcode_handler(p_server->model_handle, &request_message, p_server);
}

static void set_attention_timer(health_server_t * p_server, uint8_t attention_value, bool acked)
{
    const health_msg_attention_set_t request = { .attention = attention_value };
    access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, acked ? HEALTH_OPCODE_ATTENTION_SET : HEALTH_OPCODE_ATTENTION_SET_UNACKED);

    health_msg_attention_status_t expected_reply = { .attention = attention_value }; /* Note: this variable must be declared outside the if() */
    if(acked)
    {
        EXPECT_REPLY(p_server->model_handle, HEALTH_OPCODE_ATTENTION_STATUS, &expected_reply, sizeof(expected_reply));
    }

    call_opcode_handler(p_server->model_handle, &request_message, p_server);
}

/********** Test initialization and finalization **********/

void setUp(void)
{
    access_mock_Init();
    access_config_mock_Init();
    access_model_add_StubWithCallback(access_model_add_mock);
    access_model_reply_StubWithCallback(access_model_reply_mock);
    access_model_publish_StubWithCallback(access_model_publish_mock);
    access_model_publish_period_get_StubWithCallback(access_model_publish_period_get_mock);

    access_reliable_mock_Init();
    bearer_event_mock_Init();

    timer_scheduler_mock_Init();
    timer_sch_schedule_StubWithCallback(timer_sch_schedule_mock);

    nrf_mesh_mock_Init();
    nrf_mesh_unique_token_get_IgnoreAndReturn((nrf_mesh_tx_token_t)0x55AA55AAul);

    bearer_event_critical_section_begin_Ignore();
    bearer_event_critical_section_end_Ignore();
}

void tearDown(void)
{
    TEST_ASSERT_FALSE(m_reply_expected);
    TEST_ASSERT_FALSE(m_timer_sch_schedule_expected);
    TEST_ASSERT_FALSE(m_attention_callback_expected);
    TEST_ASSERT_FALSE(m_publish_expected);
    TEST_ASSERT_FALSE(m_publish_period_get_expected);

    access_mock_Verify();
    access_mock_Destroy();

    access_config_mock_Verify();
    access_config_mock_Destroy();

    access_reliable_mock_Verify();
    access_reliable_mock_Destroy();

