NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_health_server.c
    bearer_event_mock_Verify();
    bearer_event_mock_Destroy();

    timer_scheduler_mock_Verify();
    timer_scheduler_mock_Destroy();

    nrf_mesh_mock_Verify();
    nrf_mesh_mock_Destroy();
}

/********** Test cases **********/

void test_faultarray(void)
{
    health_server_t server;
    health_server_selftest_t test_array[] = {{ .test_id = 0x01, .selftest_function = selftest_test_function }};
    TEST_ASSERT_EQUAL(NRF_SUCCESS, health_server_init(&server, TEST_ELEMENT_INDEX, TEST_COMPANY_ID, NULL, test_array, ARRAY_SIZE(test_array)));

    TEST_ASSERT_EQUAL(0, health_server_fault_count_get(&server));

    /* Cheat, and set the fast period divisor manually to 2 (giving an actual divisor of 2^2): */
    server.fast_period_divisor = 2;

    /*
     * The publish interval for the Current Status will be divided by the fast period divisor and a new publish period
     * will be set when a fault is registered.
     */
    EXPECT_PUBLISH_PERIOD_GET(server.model_handle, ACCESS_PUBLISH_RESOLUTION_1S, 2);
    access_model_publish_period_set_ExpectAndReturn(server.model_handle, ACCESS_PUBLISH_RESOLUTION_100MS, 5, NRF_SUCCESS);

    health_server_fault_register(&server, 0xf1);
    TEST_ASSERT_EQUAL(1, health_server_fault_count_get(&server));
    TEST_ASSERT_TRUE(health_server_fault_is_set(&server, 0xf1));

    health_server_fault_register(&server, 0x22);
    TEST_ASSERT_EQUAL(2, health_server_fault_count_get(&server));
    TEST_ASSERT_TRUE(health_server_fault_is_set(&server, 0x22));

    TEST_ASSERT_FALSE(health_server_fault_is_set(&server, 0x00));
    TEST_ASSERT_FALSE(health_server_fault_is_set(&server, 0x88));
    TEST_ASSERT_FALSE(health_server_fault_is_set(&server, 0xff));

    health_server_fault_clear(&server, 0xf1);
    TEST_ASSERT_EQUAL(1, health_server_fault_count_get(&server));
    TEST_ASSERT_FALSE(health_server_fault_is_set(&server, 0xf1));
    TEST_ASSERT_TRUE(health_server_fault_is_set(&server, 0x22));

    access_model_publish_period_set_ExpectAndReturn(server.model_handle, ACCESS_PUBLISH_RESOLUTION_1S, 2, NRF_SUCCESS);
    health_server_fault_clear(&server, 0x22);
    TEST_ASSERT_EQUAL(0, health_server_fault_count_get(&server));
    TEST_ASSERT_FALSE(health_server_fault_is_set(&server, 0xf1));
    TEST_ASSERT_FALSE(health_server_fault_is_set(&server, 0x22));
}

void test_selftest(void)
{
    health_server_t server;
    health_server_selftest_t test_array[] =
    {
        { .test_id = 0x34, .selftest_function = selftest_test_function },
        { .test_id = 0xf1, .selftest_function = selftest_test_function },
    };
    TEST_ASSERT_EQUAL(NRF_SUCCESS, health_server_init(&server, TEST_ELEMENT_INDEX, TEST_COMPANY_ID, NULL, test_array, ARRAY_SIZE(test_array)));

    /* Check that no faults are returned after initialization: */
    {
        const health_msg_fault_get_t request = { .company_id = TEST_COMPANY_ID };
        access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, HEALTH_OPCODE_FAULT_GET);

        health_msg_fault_status_t expected_reply = { .test_id = 0, .company_id = TEST_COMPANY_ID };
        EXPECT_REPLY(server.model_handle, HEALTH_OPCODE_FAULT_STATUS, &expected_reply, sizeof(expected_reply));
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

    /* Run the selftest function with ID 0xf1: */
    {
        const health_msg_fault_test_t request = { .test_id = 0xf1, .company_id = TEST_COMPANY_ID };
        access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, HEALTH_OPCODE_FAULT_TEST);

        const uint8_t expected_faults[] = { 0x2f, 0x88 };
        mp_next_faults = expected_faults;
        m_next_faults_count = sizeof(expected_faults);

        uint8_t reply_buffer[sizeof(health_msg_fault_status_t) + 2];
        health_msg_fault_status_t * p_expected_reply = (health_msg_fault_status_t *) reply_buffer;
        p_expected_reply->test_id = 0xf1;
        p_expected_reply->company_id = TEST_COMPANY_ID;
        memcpy(p_expected_reply->fault_array, expected_faults, sizeof(expected_faults));

        EXPECT_PUBLISH_PERIOD_GET(server.model_handle, ACCESS_PUBLISH_RESOLUTION_100MS, 0);
        access_model_publish_period_set_ExpectAndReturn(server.model_handle, ACCESS_PUBLISH_RESOLUTION_100MS, 0, NRF_SUCCESS);
        EXPECT_REPLY(server.model_handle, HEALTH_OPCODE_FAULT_STATUS, reply_buffer, sizeof(reply_buffer));
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

    /* Clear the fault array using an unacked message: */
    {
        const health_msg_fault_clear_t request = { .company_id = TEST_COMPANY_ID };
        access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, HEALTH_OPCODE_FAULT_CLEAR_UNACKED);
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

    /* Verify that the fault array was cleared: */
    {
        const health_msg_fault_get_t request = { .company_id = TEST_COMPANY_ID };
        access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, HEALTH_OPCODE_FAULT_GET);

        health_msg_fault_status_t expected_reply = { .test_id = 0xf1, .company_id = TEST_COMPANY_ID };
        EXPECT_REPLY(server.model_handle, HEALTH_OPCODE_FAULT_STATUS, &expected_reply, sizeof(expected_reply));
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

    /* Manually set a fault in the current fault array and verify that it is carried through to the registered fault array: */
    health_server_fault_register(&server, 0x25);

    /* Verify that the fault is set: */
    bool verified_after_clear = false;
_verify_fault_set:
    {
        const health_msg_fault_get_t request = { .company_id = TEST_COMPANY_ID };
        access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, HEALTH_OPCODE_FAULT_GET);

        uint8_t reply_buffer[sizeof(health_msg_fault_status_t) + 1];
        health_msg_fault_status_t * p_expected_reply = (health_msg_fault_status_t *) reply_buffer;
        p_expected_reply->test_id = 0xf1;
        p_expected_reply->company_id = TEST_COMPANY_ID;
        p_expected_reply->fault_array[0] = 0x25;
        EXPECT_REPLY(server.model_handle, HEALTH_OPCODE_FAULT_STATUS, reply_buffer, sizeof(reply_buffer));
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

