NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_health_server.c
    /* Clear the fault and check that it is still set in the registered fault array: */
    health_server_fault_clear(&server, 0x25);
    if(!verified_after_clear)
    {
        verified_after_clear = true;
        goto _verify_fault_set;
    }
}

void test_attention(void)
{
    health_server_t server;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, health_server_init(&server, TEST_ELEMENT_INDEX, TEST_COMPANY_ID, attention_callback, NULL, 0));

    /* Get the attention timer value to verify that it is 0 after initialization: */
    verify_attention_timer(&server, 0);

    /* Set the attention timer to 5 seconds: */
    EXPECT_TIMER_SCH_SCHEDULE();
    EXPECT_ATTENTION_CALLBACK(&server, true);
    set_attention_timer(&server, 5, true);

    /* Run the timer scheduler until the attention timer expires: */
    for(int i = 0; i < 4; ++i)
    {
        TIMER_SCH_TRIGGER();
        verify_attention_timer(&server, 5 - (i + 1));
    }

    EXPECT_ATTENTION_CALLBACK(&server, false);
    timer_sch_abort_ExpectAnyArgs(); /* The timer should be cancelled because all attention timers have expired. */
    TIMER_SCH_TRIGGER();

    /* The attention timer should be 0 at this point: */
    verify_attention_timer(&server, 0);

    /* Set the attention timer to 3 seconds with a unacked message: */
    EXPECT_TIMER_SCH_SCHEDULE();
    EXPECT_ATTENTION_CALLBACK(&server, true);
    set_attention_timer(&server, 3, false);

    /* Verify the attention timer value: */
    verify_attention_timer(&server, 3);

    /* Reduce the attention timer to 1: */
    TIMER_SCH_TRIGGER();
    TIMER_SCH_TRIGGER();

    /* Verify the attention timer value: */
    verify_attention_timer(&server, 1);

    /* Set the attention timer to 11: */
    set_attention_timer(&server, 11, true);

    /* Run the attention timer for a little while: */
    for(int i = 0; i < 5; ++i)
    {
        TIMER_SCH_TRIGGER();
        verify_attention_timer(&server, 11 - (i + 1));
    }

    /* Cancel the attention timer: */
    set_attention_timer(&server, 0, true);

    /* The timer will then be cancelled at the next timer tick: */
    EXPECT_ATTENTION_CALLBACK(&server, false);
    timer_sch_abort_ExpectAnyArgs();
    TIMER_SCH_TRIGGER();

    /* Verify that the attention timer has the correct value: */
    verify_attention_timer(&server, 0);
}

void test_multimodel_attention(void)
{
    health_server_t servers[5];
    const uint8_t attention_values[5] = { 4, 5, 1, 11, 10 };
    const uint8_t max_attention_value = 11; /* max(attention_values) */

    EXPECT_TIMER_SCH_SCHEDULE();
    for(int i = 0; i < 5; ++i)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, health_server_init(&servers[i], TEST_ELEMENT_INDEX + i, TEST_COMPANY_ID, attention_callback, NULL, 0));

        EXPECT_ATTENTION_CALLBACK(&servers[i], true);
        set_attention_timer(&servers[i], attention_values[i], true);
    }

    /* Run the timer scheduler and ensure all timers expire when they should: */
    for(unsigned int i = 0; i < max_attention_value; ++i)
    {
        for(unsigned int d = 0; d < sizeof(attention_values); ++d)
        {
            verify_attention_timer(&servers[d],
                    attention_values[d] - i <= attention_values[d] ? attention_values[d] - i : 0);

            if(i + 1 == attention_values[d])
            {
                EXPECT_ATTENTION_CALLBACK(&servers[d], false);
            }
        }

        if(i == max_attention_value - 1u)
        {
            timer_sch_abort_ExpectAnyArgs();
        }

        TIMER_SCH_TRIGGER();
    }
}

void test_status_period(void)
{
    health_server_t server;
    health_server_selftest_t test_array[] = {{ .test_id = 0x01, .selftest_function = selftest_test_function }};
    TEST_ASSERT_EQUAL(NRF_SUCCESS, health_server_init(&server, TEST_ELEMENT_INDEX, TEST_COMPANY_ID, NULL, test_array, ARRAY_SIZE(test_array)));

    /* Check that the default value of the fast period divisor is 0: */
    {
        access_message_rx_t request_message = ACCESS_MESSAGE_RX_EMPTY(HEALTH_OPCODE_PERIOD_GET);
        health_msg_period_status_t expected_reply = { .fast_period_divisor = 0 };
        EXPECT_REPLY(server.model_handle, HEALTH_OPCODE_PERIOD_STATUS, &expected_reply, sizeof(expected_reply));
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

    /* Set the fast period divisor to 5: */
    {
        const health_msg_period_set_t request = { .fast_period_divisor = 5 };
        access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, HEALTH_OPCODE_PERIOD_SET);

        health_msg_period_status_t expected_reply = { .fast_period_divisor = 5};
        EXPECT_REPLY(server.model_handle, HEALTH_OPCODE_PERIOD_STATUS, &expected_reply, sizeof(expected_reply));
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

    /* Set the fast period divisor to 8: */
    {
        const health_msg_period_set_t request = { .fast_period_divisor = 8 };
        access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, HEALTH_OPCODE_PERIOD_SET_UNACKED);
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

    /* Check that the default value of the fast period divisor is 8: */
    {
        access_message_rx_t request_message = ACCESS_MESSAGE_RX_EMPTY(HEALTH_OPCODE_PERIOD_GET);
        health_msg_period_status_t expected_reply = { .fast_period_divisor = 8 };
        EXPECT_REPLY(server.model_handle, HEALTH_OPCODE_PERIOD_STATUS, &expected_reply, sizeof(expected_reply));
        call_opcode_handler(server.model_handle, &request_message, &server);
    }

    /* Try setting the divisor to an invalid value: */
    {
        const health_msg_period_set_t request = { .fast_period_divisor = 18 }; /* 15 is the maximum according to the spec */
        access_message_rx_t request_message = ACCESS_MESSAGE_RX(request, HEALTH_OPCODE_PERIOD_SET);

        health_msg_period_status_t expected_reply = { .fast_period_divisor = 8}; /* The invalid value should have been ignored */
        EXPECT_REPLY(server.model_handle, HEALTH_OPCODE_PERIOD_STATUS, &expected_reply, sizeof(expected_reply));
        call_opcode_handler(server.model_handle, &request_message, &server);
    }
}

